---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentDetailComponent
source: html/379c121d-6960-41a0-1b6b-d1033472d97e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentDetailComponent Property

While making curved beam type "[Type Name]" 2D Detail Component elements were not created

## Syntax (C#)
```csharp
public static FailureDefinitionId NotBentDetailComponent { get; }
```